HerbyR56/TonUINO_ESP32/src/main.cpp
#include <WiFi.h>
#include <WiFiClient.h>
#include <WiFiManager.h>  
#include <WebServer.h>
#include <ArduinoJson.h>
#include "ESP32FtpServer.h"
//#include <SPI.h>
#include <MFRC522.h>
#include "pinout.h"
#include "carddata.h"
//#include "dirdata.h"
//#include "SampleMp3.h"
#include "vs1053_ext.h"
#include <JC_Button.h>          // https://github.com/JChristensen/JC_Button
//#include "Mp3Player/src/mp3player.h"
#include "stringarray.h"
#include <FastLED.h>

#define buttonPlay      button1
#define buttonSkipPlus  button2
#define buttonSkipMinus button3
#define buttonVolMinus  button4
#define buttonVolPlus   button5

unsigned long displayTimer; //courtesy time to display info
TaskHandle_t Task1;
TaskHandle_t Task2;

//char testString[256];
const unsigned long WIFI_TIMEOUT = 5000; //ms

bool volumeEnabled = true;

const uint8_t START_VOLUME = 14;
const uint8_t MAX_VOLUME = 21; //org = 20
const uint8_t MIN_VOLUME = 4;
uint8_t   volume = START_VOLUME;

      unsigned long lastStandbyCheck      = 0;
const unsigned long standbyCheckIntervall = 1000;

const unsigned long BLINK_TIME            = 50;
      unsigned long lastGetFileList       = 0;
      unsigned long getFileListValidFor   = 5 *60 *1000;

String lastTrack;
String lastCardId;
WiFiClient client;

unsigned long       standbyTimer=0;
const unsigned long gotoStandbyAfter= 5 *60 *1000; //ms


const char PROGMEM rootFileName[]        = "/root.html";
const char PROGMEM mainPageFileName[]    = "/mainpage.html";

const char PROGMEM assignPageFileName[]  = "/assignpage.html";
const char PROGMEM tmpFileName[]         = "/mainpage.tmp";
const char PROGMEM cardsFileName[]       = "/cards.json";
const char PROGMEM dirFileName[]         = "/dir.tmp";


#define TRACK_NAME      "#TRACK_NAME#"
#define TRACK_IDX       "#TRACK_IDX#"
#define CARD_ID         "#CARD_ID#"
#define CARD_ID_LEGEND  "#CARD_ID_LEGEND#"
#define OPTIONS         "#OPTIONS#"
#define SELECTED        "#SELECTED#"
#define NEW_CARD_SELECT "#NEW_CARD_SELECT#"
/*
const char PROGMEM CARD_SELECT [] =   "<label for=\"" CARD_ID "\">Karte " CARD_ID "</label>\r\n"
                                      "<select name=\"" CARD_ID "\" id=\"" CARD_ID "\">\r\n"
                                      "<option value=\"none\">---</option>\r\n"
                                      OPTIONS
                                      "</select>\r\n\r\n";
*/
const char PROGMEM CARD_SELECT [] =   "<fieldset>\r\n<legend>" CARD_ID_LEGEND "</legend>\r\n"
                                      "<select name=\"" CARD_ID "\" id=\"" CARD_ID "\">\r\n"
                                      "<option value=\"none\">---</option>\r\n"
                                      OPTIONS
                                      "</select>\r\n"
                                      "<button type=\"submit\" formaction=\"/deletecard?deletecardid=" CARD_ID "\">delete</button>\r\n"
                                      "</fieldset>\r\n"
                                      "\r\n";


const char PROGMEM OPTION [] ="<option  value=\"" TRACK_IDX "\" " SELECTED ">" TRACK_NAME "</option>";



const char PROGMEM OK_REDIRECT_MAINPAGE [] = "<!DOCTYPE html><html><head><meta http-equiv=\"refresh\" content=\"1; URL=/\"><title>OK</title></head><body>OK :-) (mainpage in 3 sec.)</body></html>";


MFRC522   mfrc522(MFRC522_CS, 0/*MFRC522_RST*/);  // Create MFRC522 instance

FtpServer ftpSrv;   
WebServer server(80); 
VS1053 player(VS1053_CS, VS1053_DCS, VS1053_DREQ);


Button button1(BUTTON_1, 25, INPUT, false); 
Button button2(BUTTON_2, 25, INPUT_PULLUP, true); 
Button button3(BUTTON_3, 25, INPUT_PULLDOWN, false); 
Button button4(BUTTON_4, 25, INPUT, false); 
Button button5(BUTTON_5, 25, INPUT, false); 

/*
#define uS_TO_S_FACTOR 1000000  // Conversion factor for micro seconds to seconds 
#define TIME_TO_SLEEP  10       // Time ESP32 will go to sleep (in seconds) 
*/

#define BUTTON_PIN_BITMASK 0x200000000 // 2^33 in hex
RTC_DATA_ATTR int bootCount = 0;


//start fastled
#define DATA_PIN    LED_Ring
//#define CLK_PIN   4
#define LED_TYPE    WS2812
#define COLOR_ORDER GRB
#define NUM_LEDS    16
CRGB leds[NUM_LEDS];
#define BRIGHTNESS          128
#define FRAMES_PER_SECOND 120
//end fastled
//int volumeLED, playLED = 0;  //global variable for palystate and volume state
const int LED_COUNT = 16;

/*
Method to print the reason by which ESP32
has been awaken from sleep
*/
void print_wakeup_reason(){
  esp_sleep_wakeup_cause_t wakeup_reason;

  wakeup_reason = esp_sleep_get_wakeup_cause();

  switch(wakeup_reason)
  {
    case ESP_SLEEP_WAKEUP_EXT0 : Serial.println("Wakeup caused by external signal using RTC_IO"); break;
    case ESP_SLEEP_WAKEUP_EXT1 : Serial.println("Wakeup caused by external signal using RTC_CNTL"); break;
    case ESP_SLEEP_WAKEUP_TIMER : Serial.println("Wakeup caused by timer"); break;
    case ESP_SLEEP_WAKEUP_TOUCHPAD : Serial.println("Wakeup caused by touchpad"); break;
    case ESP_SLEEP_WAKEUP_ULP : Serial.println("Wakeup caused by ULP program"); break;
    default : Serial.printf("Wakeup was not caused by deep sleep: %d\n",wakeup_reason); break;
  }
}

void resetStandbyTimer()
{
   standbyTimer = millis();
}

void led(int pin, bool on)
{
  if ((pin == LED_1)
    ||(pin == LED_2)
    ||(pin == LED_3)
    ||(pin == LED_4)
    ||(pin == LED_5))
  {
    digitalWrite(pin, !on);
  }
}

void flashLed(int pin, unsigned long time = BLINK_TIME)
{
  if ((pin == LED_1)
    ||(pin == LED_2)
    ||(pin == LED_3)
    ||(pin == LED_4)
    ||(pin == LED_5))
  {
    //led(pin,false);
    led(pin,true);
    delay(time);
    //led(pin,true);
    led(pin,false);
  }
}

void flashRing(struct CRGB ringColor, unsigned long time = BLINK_TIME)
{
  FastLED.clear(true);
  for (int i = 0; i < LED_COUNT; i=i+(round(LED_COUNT/4)))
  {
    leds[i] = ringColor;
  }
  FastLED.show();
  delay(time);
}

void getFileList(fs::FS &fs, StringArray* array, const char * dirname, uint8_t levels, bool onlyDirAndM3U =true)
{
    lastGetFileList= millis();
    File root = fs.open(dirname);
    if(!root){
        Serial.println("Failed to open directory");
        return;
    }
    if(!root.isDirectory()){
        Serial.println("Not a directory");
        return;
    }

    File file = root.openNextFile();
    while(file){
        if(file.isDirectory()){
            Serial.print("  adding DIR : ");
            Serial.println(file.name());
            array->add(file.name());
            if(levels){
                getFileList(fs, array, file.name(), levels -1, onlyDirAndM3U);
            }
        } else {
          
            String fileName = file.name();
            fileName.toUpperCase();
            if ((!onlyDirAndM3U && fileName.endsWith(".MP3")) 
             || (!onlyDirAndM3U && fileName.endsWith(".M4A"))
             || fileName.endsWith(".M3U"))
            {
              Serial.print("adding  FILE: ");
              Serial.print(file.name());
              Serial.print("  SIZE: ");
              Serial.println(file.size());
              array->add(file.name());
            }
        }
        file = root.openNextFile();
    }
}


