HerbyR56/TonUINO_ESP32/src/main.cpp
void saveAssignPage(StringArray* array, const char * fileName, bool allCards)
{
  String page;
  if (SD.exists(mainPageFileName))
  {
    fs::File file = SD.open(mainPageFileName, "r");
    if (file)
    {
      while (file.available())
      {
        page += (char)file.read();
      }
      file.close();
      
      file = SD.open(fileName,"w");
      if (file)
      {
        int pos = page.indexOf(NEW_CARD_SELECT);
        if (pos>0)
        {
          file.write((const uint8_t*)page.c_str(), pos);

          for (int cardIdx=0; cardIdx<cardData.getCardCount(); cardIdx++)
          {
            Card& card = cardData.getCard(cardIdx);
            if (!card.isDeleted && card.ID.length())
            {
              String select = CARD_SELECT;
              String cardId = card.ID;
              select.replace(CARD_ID, cardId);

              if (card.ID.equals(lastCardId))
              {
                cardId = "<b>" + cardId + "</b>";
              }
              select.replace(CARD_ID_LEGEND, cardId);

              String options;
              bool foundOption=false;

              for (int item=0; item < array->getCount(); item++)
              {
                String option = OPTION;
                const String& track = array->getItem(item);

                String printableTrack = StringArray::convertToUTF8(track);
                //String htmlTrack = StringArray::convertToHTML(printableTrack);
                //option.replace(TRACK_NAME, htmlTrack);
                option.replace(TRACK_NAME, printableTrack);
                option.replace(TRACK_IDX, String(item));
                if (card.track.equalsIgnoreCase(track))
                {
                  Serial.print("\tfound option for card  ");
                  Serial.print(card.ID);
                  Serial.print(": ");
                  Serial.println(track);
                  foundOption=true;
                  option.replace(SELECTED, "selected");
                }
                else
                {
                  option.replace(SELECTED, "");
                }
                options+=option + "\r\n";

              }

              if (!foundOption)
              {
                Serial.print("\tNo option found for card ");
                Serial.print(card.ID);
                Serial.print(": ");
                Serial.println(card.track);
              }

              if (allCards || !foundOption) 
              {
                select.replace(OPTIONS, options);
                file.print(select.c_str());
              }
            }
          }

          file.print(page.c_str()+pos+strlen(NEW_CARD_SELECT)); //dirty
          file.close();
        }
        else
        {
          int todo;
        }
      }
      else
      {
        int todo;
      }
    } 
    else
    {
      int todo;
    }
  }  
}

String getUidString(MFRC522::Uid* uid)
{
  String uidString;
	for (byte i = 0; i < uid->size; i++) 
  {
    if (i>0)
    {
      uidString +=":";
    }
		if(uid->uidByte[i] < 0x10)
    {
			uidString +=F("0");
    }
		uidString +=String (uid->uidByte[i], HEX);
	} 
  return uidString;
}
/*
bool writeJsonFile(const char * fileName, const JsonArray& json) 
{
  Serial.print("Saving json file ");
  Serial.print (fileName);

  fs::File f = SD.open(fileName, "w");
  if (!f) 
  {
    Serial.println(" Failed to open json file for writing");
    return false;
  }

  json.prettyPrintTo(Serial);

  json.prettyPrintTo(f);
  f.close();

  Serial.println(" json file was successfully saved");
  
  return true;
}
*/

bool writeJsonFile(const char * fileName, const JsonObject& json) 
{
  
  Serial.print("Saving json file ");
  Serial.print (fileName);

  fs::File f = SD.open(fileName, "w");
  if (!f) 
  {
    Serial.println(" Failed to open json file for writing");
    return false;
  }

  json.prettyPrintTo(Serial);
  json.prettyPrintTo(f);
  f.close();

  Serial.println(" json file was successfully saved");
  
  return true;
}

bool writeCardsFile() 
{
   
  Serial.println("Saving Cards file");
   
  // JSONify local configuration parameters
  // json["ip"] = staticIp.c_str();

  DynamicJsonBuffer jsonBuffer;
  JsonObject& root = jsonBuffer.createObject();

  JsonArray& jsonArray = root.createNestedArray(("Cards"));
  
  for (int i=0; i<cardData.getCardCount();i++)
  {
    //DynamicJsonBuffer jsonBuffer;
    JsonObject& json = jsonArray.createNestedObject();
    const Card& card = cardData.getCard(i);
    if (!card.isDeleted)
    {
      Serial.print("Writing Card ");
      Serial.print(card.ID);
      Serial.print(": ");
      Serial.println(card.track);
      json["ID"] = card.ID;
      json["Track"] = card.track;
    }
  }

  return writeJsonFile(cardsFileName, root );
}

bool readCardsFile() 
{
  fs::File f = SD.open(cardsFileName, "r");
  
  if (!f) 
  {
    Serial.println("Cards file not found");
    return false;
  } 
  else 
  {
    size_t size = f.size();
    // Allocate a buffer to store contents of the file.
    std::unique_ptr<char[]> buf(new char[size+1]);

    unsigned long read = f.readBytes(buf.get(), size);
    buf[size]=0;
    f.close();
    if (read)
    {
      DynamicJsonBuffer jsonBuffer;
      JsonObject& json = jsonBuffer.parseObject(buf.get());
      //JsonArray& array = jsonBuffer.parseArray(buf.get());
      if (!json.success()) 
      {
        Serial.println("JSON Object() failed");
        Serial.println(buf.get());
        return false;
      }
      json.prettyPrintTo(Serial);

      JsonArray& cards = json["Cards"];
      for (int i=0; i<cards.size();i++)
      {
        JsonObject& j = cards[i];
        String ID    = j["ID"];
        String Track = j["Track"];
        if (ID.length())
        {
          cardData.addCard(ID,Track);
        }
      } 
  /*
      if (json.containsKey("ip")) 
      {
        staticIp = (const char*)json["ip"];      
      }
      if (json.containsKey("gw")) 
      {
        staticGateway = (const char*)json["gw"];      
      }
      if (json.containsKey("sn")) 
      {
        staticSubnetMask = (const char*)json["sn"];      
      }
  */
    }
    else
    {
      Serial.println("File empty");
    }

