HerbyR56/TonUINO_ESP32/src/main.cpp
  }
  Serial.println("\nConfig file was successfully parsed");
  
  return true;
}

void notFound()
{
  String message = "File Not Found\n\n";
  message += "URI: ";
  message += server.uri();
  message += "\nMethod: ";
  message += (server.method() == HTTP_GET)?"GET":"POST";
  message += "\nArguments: ";
  message += server.args();
  message += "\n";
  for (int i=0; i<server.args(); i++)
  {
    message += " " + server.argName(i) + ": " + server.arg(i) + "\n";
  }
  server.send(404, "text/plain", message);

}
/*
void gradientRing(int R, int G, int B)
{
  for (int i = 0; i != LED_COUNT; i++)
  {
    if (i <= voler) leds[i].setRGB();
    else leds[i] = CRBG:BLACK; //turn other LEDs off
  }

}*/

void setVolume(int newVolume)
{
  player.setVolume(newVolume);
  volume = newVolume;
  ESP_LOGV(TAG, "Changing volume to %d", volume);
    float volers = (float) (( (float) volume / (float) MAX_VOLUME) * (float)LED_COUNT);
    int volumeLEDS = (int) volers;
    int volumeLEDS = round( (volume / MAX_VOLUME) * LED_COUNT); //test
    for (int j = 0; j != LED_COUNT; j++)
      {
      if (j <= volumeLEDS) leds[j].setRGB(j*(128/NUM_LEDS), (LED_COUNT*(128/NUM_LEDS))-(j*(128/NUM_LEDS)), 0); //dim green
      else leds[j]= CRGB::Black; //off*/
    }
    FastLED.show();
    delay(10);
    displayTimer = millis();  //make sure it stays visible
}

int changeVolume(int delta)
{
  volume += delta;
  volume = volume > MAX_VOLUME ? MAX_VOLUME : volume;
  volume = volume < MIN_VOLUME ? MIN_VOLUME : volume;
  setVolume(volume);  
  return volume;
}

void sendMainPage()
{
  fs::File file = SD.open("/root.html");
  if (file)
  {
      server.streamFile(file,"text/html");
      delay(1);
      file.close();
      delay(1);
  }

}

void serverStart()
{
  if (WiFi.isConnected())
  {

    server.on("/", HTTP_GET, [](){
      sendMainPage();
      resetStandbyTimer();
    });

   server.on("/vol-", HTTP_GET, [](){
      Serial.println("vol-");
      changeVolume(-5);
      delay(5);
      sendMainPage();
    });

    server.on("/vol+", HTTP_GET, [](){
      Serial.println("vol+");
      delay(5);
      changeVolume(+2);
      sendMainPage();
    });
  
    server.on("/volstart", HTTP_GET, [](){
      Serial.println("volstart");
      setVolume(START_VOLUME);
      sendMainPage();
    });

    server.on("/volzero", HTTP_GET, [](){
      Serial.println("volzero");
      setVolume(0);
      sendMainPage();
    });

    server.on("/start", HTTP_GET, [](){
      Serial.println("start");
      if (!player.isPlaying())
      {
        player.connecttoSD(lastTrack,true); // same track, resume
      }
      sendMainPage();
    });

    server.on("/stop", HTTP_GET, [](){
      Serial.println("stop");
      if (player.isPlaying())
      {
        player.stop_mp3client();
      }
      sendMainPage();
    });

    server.on("/disableVolume", HTTP_GET, [](){
      Serial.println("disableVolume");
      volumeEnabled = false;
      sendMainPage();
    });

    server.on("/enableVolume", HTTP_GET, [](){
      Serial.println("enableVolume");
      volumeEnabled = true;
      sendMainPage();
    });

    server.on("/nexttrack", HTTP_GET, [](){
      Serial.println("next track");
      if (player.isPlaying())
      { 
        player.nextTrack();   //skip track
        player.isPaused = 0;
      }
      sendMainPage();
    });

    server.on("/previoustrack", HTTP_GET, [](){
      Serial.println("previous track");
      if (player.isPlaying())
      {
        Serial.println(player.findPreviousPlaylistEntry());
        //player.connecttoSD(lastTrack,false); // same track, start from the beginnig (of playlist)
        player.connecttoSD(player.findPreviousPlaylistEntry(),false);
      }
      sendMainPage();
    });    

    server.on("/allcards", HTTP_GET, [](){
        ESP_LOGV(TAG, "allcards, free heap: %lu", ESP.getFreeHeap());
        std::unique_ptr<StringArray> array(new StringArray);
        unsigned long msStart =millis();
        bool loaded = false;
        /*
        if (lastGetFileList && (lastGetFileList + getFileListValidFor > millis()))
        {
          fs::File file = SD.open(dirFileName, "r");
          if (file)
          {
            array.get()->load(&file);
            loaded=true;
            file.close();
          }
        }
        */
        if (!loaded)
        {
          getFileList(SD, array.get(), "/",10);
        }
        unsigned long msSort = millis();
        array.get()->sort();
        unsigned long msSave = millis();
        saveAssignPage(array.get(), tmpFileName, true);
        unsigned long msStream = millis();
        fs::File file = SD.open(tmpFileName);
        if (file)
        {
          server.streamFile(file,"text/html");
          file.close();
          file = SD.open(dirFileName,"w");
          if (file)
          {
            array.get()->save(&file);
            file.close();
          }
        }
        else
        {
          server.send(200, "text/plain", "cannot open mainpage.tmp");
        }
        ESP_LOGV(TAG, "getFileList: %lums", msSort-msStart);
        ESP_LOGV(TAG, "sort: %lums", msSave-msSort);
        ESP_LOGV(TAG, "save: %lums", msStream-msSave);
        ESP_LOGV(TAG, "streamFile: %lums", millis()-msStream);
        ESP_LOGV(TAG, "allcards end, free heap: %lu", ESP.getFreeHeap());
        resetStandbyTimer();
  });


      server.on("/newcards", HTTP_GET, [](){
          ESP_LOGV(TAG, "newcards, free heap: %lu", ESP.getFreeHeap());
          std::unique_ptr<StringArray> array(new StringArray);
          unsigned long msStart =millis();
          bool loaded = false;
/*
          if (lastGetFileList && (lastGetFileList + getFileListValidFor > millis()))
          {
            fs::File file = SD.open(dirFileName, "r");
            if (file)
            {
              array.get()->load(&file);
              loaded=true;
              file.close();
            }
          }
*/          
          if (!loaded)
          {
            getFileList(SD, array.get(), "/",10);
          }

          unsigned long msSort = millis();
          array.get()->sort();
          unsigned long msSave = millis();
          saveAssignPage(array.get(), tmpFileName, false);
          unsigned long msStream = millis();
          fs::File file = SD.open(tmpFileName);
          if (file)
          {
            server.streamFile(file,"text/html");
            file.close();
            file = SD.open(dirFileName,"w");
            if (file)
            {
              array.get()->save(&file);
              file.close();
            }
          }
          else
          {
            server.send(200, "text/plain", "cannot open mainpage.tmp");
          }
          ESP_LOGV(TAG, "getFileList: %lums", msSort-msStart);
          ESP_LOGV(TAG, "sort: %lums", msSave-msSort);
          ESP_LOGV(TAG, "save: %lums", msStream-msSave);
          ESP_LOGV(TAG, "streamFile: %lums", millis()-msStream);
          ESP_LOGV(TAG, "newcards end, free heap: %lu", ESP.getFreeHeap());
          resetStandbyTimer();
    });

    server.on("/saveassignment", HTTP_POST, [] () {
      Serial.println("PostMessage");
      String errorString;
      if (server.args())
      {
        std::unique_ptr<StringArray> array(new StringArray);
        fs::File file = SD.open(dirFileName);
        if (file)
        {
          array.get()->load(&file);

