HerbyR56/TonUINO_ESP32/src/main.cpp
          Serial.print("loaded dirFile, found entries:");
          Serial.println(array.get()->getCount());

          file.close();
          Serial.print("Arguments: ");
          Serial.println(server.args());
          for (int i=0; i<server.args(); i++)
          {
            Serial.println(String(server.argName(i)) + ": " + server.arg(i) + "\n");
            Card& card = cardData.getCard(server.argName(i));
            if (card.ID.length())
            {
              if (server.arg(i).equalsIgnoreCase("none"))
              {
                card.track = "";
              }
              else
              {
                int idx = server.arg(i).toInt();
                if (idx>=0)
                {
                  Serial.print(card.ID);
                  Serial.print(": assigning ");
                  card.track = array.get()->getItem(idx);
                  Serial.println(card.track);
                }
              }
            }
          }
          writeCardsFile();
        }
        server.send(200, "text/html", OK_REDIRECT_MAINPAGE);

      }
      else
      {
        int todo;
        server.send(200, "text/plain", "#todo (cant open temp file)");
      }

      int todo;
      Serial.print("Free Heap:");
      Serial.println(ESP.getFreeHeap());
      Serial.println(".");
      resetStandbyTimer();
    });


  server.on("/deletecard", HTTP_POST, [] () {
      Serial.print("delete card");
      String errorString;
      if (server.args())
      {
        Serial.print("Arguments: ");
        Serial.println(server.args());
        for (int i=0; i<server.args(); i++)
        {
          Serial.println(String(server.argName(i)) + ": " + server.arg(i) + "\n");
          if (server.argName(i).equals("deletecardid"))
          {
            Serial.print("looking for deletecardid = ");
            Serial.print(server.arg(i));
            Card& card = cardData.getCard(server.arg(i));
            if (card.ID.length())
            {
              Serial.print("deleting ");
              Serial.println(card.ID);
              card.isDeleted = true;
              server.send(200, "text/html", OK_REDIRECT_MAINPAGE);
            }
            else
            {
              int todo;
              server.send(200, "text/plain", "#todo (cant find card)");
            }
          }
        }
        writeCardsFile();
      }

      Serial.print("Free Heap:");
      Serial.println(ESP.getFreeHeap());
      Serial.println(".");
      resetStandbyTimer();

    });

    server.onNotFound(notFound);
    server.begin();
  }
}

void wifiStart()
  {
    if (digitalRead(BUTTON_PLAY))  //enable WIFI if play button pressed during startup
    {
      WiFiManager WifiManager;
      String hostName = String(F("ESPFTP")) + String((unsigned long)ESP.getEfuseMac()); 

      // generate the Access Point 
      WiFi.setHostname(hostName.c_str());
      WifiManager.autoConnect("ESP32");

      Serial.print("MyIP:");
      Serial.println(WiFi.localIP().toString());
      Serial.print("MyMac:");
      Serial.println(WiFi.macAddress());
      WiFi.setHostname(hostName.c_str());
      Serial.print("MyHostName:");
      Serial.println(WiFi.getHostname());
      flashRing(CRGB::Blue,500); //signal active WIFI
    }
    else
    {
      unsigned long waitUntil = millis() + WIFI_TIMEOUT;
      WiFi.begin(); //
      uint8_t status;
      do
      {
        delay(150);
        //flashLed(LED_2);
        status = WiFi.status();
      } 
      while ((status != WL_CONNECTED && status != WL_CONNECT_FAILED)
             && millis()<waitUntil);

    }

  }

  void standBy()
  {
          // Wake up button 3
      esp_sleep_enable_ext0_wakeup(GPIO_NUM_33,1); //1 = High, 0 = Low
      Serial.println("Going to sleep now");
      Serial.flush(); 
      esp_deep_sleep_start();
  }

  void handleButtons()
  {
    button1.read();
    button2.read();
    button3.read();
    button4.read();
    button5.read();

    if (buttonVolMinus.pressedFor(100))
    { 
      resetStandbyTimer();
      Serial.println("vol- pressed");
      if (player.isPlaying())
      {
        changeVolume(-1);
        flashLed(LED_VOL_MINUS,100);
      }
    }

    if (buttonVolPlus.pressedFor(100))
    {
      resetStandbyTimer();
      Serial.println("vol+ pressed");
      if (player.isPlaying())
      {
        if (volumeEnabled)
        {
          changeVolume(+1);
        }
        flashLed(LED_VOL_PLUS,100);
      }
    }

    /*if (buttonStop.pressedFor(100))
    {
      Serial.println("stop pressed");
      resetStandbyTimer();
      flashLed(LED_STOP);
      player.stop_mp3client();
    }*/
    if (buttonSkipPlus.pressedFor(100))
    {
      Serial.println("Skip plus short pressed.");
      Serial.print(player.getFileSize());
      Serial.print(" ");
      Serial.println(player.getFilePos() + (24*4096));
      if (player.isPlaying() && (player.getFileSize() - 4096) > (player.getFilePos() + (24*4096))) //palying and able to skip
      {    
        flashLed(LED_SKIP_PLUS);
        uint8_t tempVolume = player.getVolume();
        player.setVolume(0);  //mute volume
          player.setFilePos(player.getFilePos() + (24*4096)); //seek
          unsigned long tTemp = millis();
          while (millis() - tTemp < 180)
          {
            player.loop();  //waiting 
          }
          player.setVolume(tempVolume); //restore volume
      }
    }

    if (buttonSkipPlus.pressedFor(3000))
    {
      resetStandbyTimer();
      Serial.println("Next track pressed.");
      if (player.isPlaying())
      { 
        flashLed(LED_SKIP_PLUS);
        player.nextTrack();   //skip track
        player.isPaused = 0;
        delay(300);
      }
    }

    if (buttonPlay.pressedFor(100))
    {
      resetStandbyTimer();
      Serial.println("Play pressed.");
      //flashLed(LED_PLAY);
      if (!player.isPlaying())
      {
        if (player.isPaused) player.isPaused = 0;      //unpause
        else player.connecttoSD(lastTrack,true); // same track, resume
      }
      else  //play is playing
      { 
        Serial.println("...toogle pause");
        delay(300);
        player.isPaused = !player.isPaused; //toggle pause
      }
      delay(200);
    }

    if (buttonSkipMinus.pressedFor(100))
    {
      Serial.println("Skip minus short pressed.");
      if (player.isPlaying() && (player.getFilePos() - (24*4096)) > (18*4096)) //palying and able to skip backwards (mind the header)
      {    
        Serial.println(player.getFilePos() - (24*4096));
        Serial.println(player.getFilePos());
        flashLed(LED_SKIP_MINUS);
        uint8_t tempVolume = player.getVolume();
        player.setVolume(0);  //mute volume
        if (player.getFilePos() - (24*4096) > 0) player.setFilePos(player.getFilePos() - (24*4096)); //seek
        unsigned long tTemp = millis();
        while (millis() - tTemp < 180)  //loop for 180ms
        {
          player.loop();  //waiting 
        }
        player.setVolume(tempVolume); //restore volume
      }
      else if ((player.getFilePos() - (24*4096)) < (18*4096))
      {
        player.connecttoSD(lastTrack,true);
        Serial.println("Restart track");
      }
    }

