HerbyR56/TonUINO_ESP32/src/main.cpp
    if (buttonSkipMinus.pressedFor(2000))
    {
      resetStandbyTimer();
      Serial.println("Previous track pressed.");
      if (player.isPlaying())
      {
        flashLed(LED_SKIP_MINUS);
        Serial.println(player.findPreviousPlaylistEntry());
        //player.connecttoSD(lastTrack,false); // same track, start from the beginnig (of playlist)
        player.connecttoSD(player.findPreviousPlaylistEntry(),false);
      }
    }

    /*if (buttonRestart.pressedFor(100))
    {
      resetStandbyTimer();
      Serial.println("restart pressed");
      if (!player.isPlaying())
      {
        if (lastTrack.length())
        {
          flashLed(LED_RESTART);
          player.connecttoSD(lastTrack,false); // same track, start from the beginnig
        }
      }
    }*/

    /*if (button4.pressedFor(3000))
    {
      standBy();
      Serial.println("This will never be printed");
    }*/

    /*if (button3.pressedFor(3000))
    {
      ESP.restart();
    }*/
 
  }
/*
  bool button(int _button)
  {
    int pin;
    switch (_button)
    {
      case 1:
        pin =BUTTON_1;
      break;
      case 2:
        pin =BUTTON_2;
      break;
      case 3:
        pin =BUTTON_3;
      break;
      case 4:
        pin =BUTTON_4;
      break; 
      case 5:
        pin =BUTTON_5;
      break;
      default:
       return false;
    }
    return digitalRead(pin);
  }
  */

 void coreFTP(void * parameter) {  //loop second core
    while (true) {
      delay(1);
  if (WiFi.isConnected())
  {
    unsigned long ms =millis();
    bool isBusy=false;
    do 
    {
      //Serial.println("prepare handle ftp");
      isBusy = ftpSrv.handleFTP();    
      if (isBusy)
      {
        //standbyTimer = millis();
      }
    }
    while (isBusy && millis()<ms+10);
    //Serial.println("prepare handle client");
    //server.handleClient();
  }
  //Serial.println("prepare handle buttons");
  //handleButtons();
      }
} 




void setup(void){
  Serial.begin(115200);
  pinMode(VS1053_ENABLE, OUTPUT);
  digitalWrite(VS1053_ENABLE, false);

  pinMode(LED_1,OUTPUT);
  pinMode(LED_2,OUTPUT);
  pinMode(LED_3,OUTPUT);
  pinMode(LED_4,OUTPUT);
  pinMode(LED_5,OUTPUT);

  pinMode(LED_Ring,OUTPUT);

  led(LED_1,true);
  led(LED_2,true);
  led(LED_3,true);
  led(LED_4,true);
  led(LED_5,true);

  FastLED.addLeds<LED_TYPE,DATA_PIN,COLOR_ORDER>(leds, NUM_LEDS).setCorrection(TypicalLEDStrip);
  // set master brightness control
  FastLED.setBrightness(BRIGHTNESS);


  button1.begin();
  button2.begin();
  button3.begin();
  button4.begin();
  button5.begin();

  wifiStart();

  if (!WiFi.isConnected())
  {
    //power saving
    Serial.println("** Stopping WiFi+BT");
    WiFi.mode(WIFI_OFF);
    btStop();
  }
  else
  {
  //led(LED_2,true);
  Serial.println("");
  Serial.print("Connected to ");
  Serial.println(WiFi.SSID().c_str());
  Serial.print("IP address: ");
  Serial.println(WiFi.localIP());
  }
  
  ++bootCount;
  Serial.println("Boot number: " + String(bootCount));
  //Print the wakeup reason for ESP32
  print_wakeup_reason();

  SPI.begin();			// Init SPI bus
  mfrc522.PCD_SetAntennaGain(0x07); //set RFID Antenna Gain to 48db
	mfrc522.PCD_Init();		// Init MFRC522
  mfrc522.PCD_SetAntennaGain(0x07); //set RFID Antenna Gain to 48db again
	mfrc522.PCD_DumpVersionToSerial();	// Show details of PCD - MFRC522 Card Reader details

  Serial.print("MFRC522 Selftest:");
  if (mfrc522.PCD_PerformSelfTest())
  {
    led(LED_3,true);
    Serial.println("OK");
  }
  else
  {
    Serial.println("fail");
  }
  mfrc522.PCD_Init();		 // again! Otherwise the reader will not read

  /////FTP Setup, ensure SD is started before ftp;  /////////
  if (SD.begin(SDCARD_CS)) {
      //led(LED_4,true);
      Serial.println("SD opened!");
      ftpSrv.begin("esp32","esp32");    //username, password for ftp.  set ports in ESP32FtpServer.h  (default 21, 50009 for PASV)
  }    

  digitalWrite(VS1053_ENABLE, true);
  player.begin();
  player.setVolume(0);    
  player.printVersion();

/*
  listDir(SD, "/", 10);
  dirInfo.sort();
*/

  readCardsFile();
  serverStart();
  player.setVolume(volume);    
  Serial.println(F("Setup Complete"));
  
  xTaskCreatePinnedToCore( //task for second core
    coreFTP,
    "Handle FTP",
    20000,
    NULL,
    1,
    &Task1,
    0 //core 0 second core
  ); 

  player.connecttoSD("/001_Los_gehts.mp3",false); //playinitial song
}

unsigned long lastCardCheck= 0;
const unsigned long cardCheckIntervall = 1000;



void loop(void)
{
  if (WiFi.isConnected())
  {
    unsigned long ms =millis();
    bool isBusy=false;
    /*todo 
    {
      isBusy = ftpSrv.handleFTP();    
      if (isBusy)
      {
        //standbyTimer = millis();
      }
    }*/
    while (isBusy && millis()<ms+10);
    server.handleClient();
  }

  handleButtons();

  player.loop();
  if (player.isPlaying())
  {
    if (player.isPaused)
    {
      flashLed(LED_1,300);  //blink paused LED while player is paused
    }
    else
    {
      standbyTimer = millis();
      if (standbyTimer - displayTimer > 2000) //wait for other info to expire
      {
        float led_switch = (float) (LED_COUNT * ((float)player.getFilePos()/(float)player.getFileSize()));
        int progressLEDS = (int) led_switch;
        int progressLEDS = roundf(LED_COUNT * (player.getFilePos()/player.getFileSize())); //test
        for (int i = 0; i != LED_COUNT; i++)
        {
          if (i <= progressLEDS) leds[i].setRGB(5+(i*(48/NUM_LEDS)), 0, 5+(i*(48/NUM_LEDS))); //dim purbple
          else leds [i] = CRGB::Black; //off        
        }
        FastLED.show(); 
      }
    }
  }
  else if(millis() - displayTimer > 2000)
  {
    displayTimer = millis();
    FastLED.clear(true); //clear ring when stopped
    FastLED.show();
    delay(1000);
    flashRing(CRGB::White); //pulse ring white while waiting for Card
  }

