HerbyR56/TonUINO_ESP32/src/main.cpp
  if (millis() > lastCardCheck + cardCheckIntervall)
  {
    lastCardCheck = millis();
    if (mfrc522.PICC_IsNewCardPresent()) 
    {
      if (mfrc522.PICC_ReadCardSerial()) 
      {
        mfrc522.PICC_HaltA();
        String uidString = getUidString(&mfrc522.uid);
        lastCardId = uidString;
        if (!cardData.cardExists(uidString))
        {
          flashRing(CRGB::Red); //Signal card known but not assigned
          displayTimer = millis();
          cardData.addCard(uidString,"");
          Serial.print("Added new card: ");
          Serial.println(uidString);
          writeCardsFile();
        }
        else
        {
          // known card
          Serial.print("Card is known: ");
          Serial.println(uidString);
          const Card& card =cardData.getCard(uidString);
          if (card.track.length() && !card.track.equalsIgnoreCase("none"))     // track assigned?
          {
            if(!(player.isPlaying() && card.track.equalsIgnoreCase(lastTrack))) // not already playing that
            {
              const String& track = card.track;
                //enable Play controls
                led(LED_5,false);
                led(LED_4,false);
                led(LED_3,false);
                led(LED_2,false);
                led(LED_1,false);
              Serial.print(" Start playing ");
              Serial.println(track.c_str());
              if (track.startsWith("http"))
              {
                  ESP_LOGV(TAG, "Play Stream");
                  flashLed(LED_GREEN);
                  player.connecttohost(track);
              } 
              else if (track.charAt(0) == '/') 
              {
                  String fileExtension;
                  int pos = track.lastIndexOf('.');
                  if (pos>track.lastIndexOf('/'))
                  {
                    fileExtension = track.substring(track.lastIndexOf('.') + 1, track.length());
                  }

                  ESP_LOGV(TAG, "Play File with Extension \"%s\"", fileExtension.c_str());

                  if (!fileExtension.length() //directory
                    || fileExtension.equalsIgnoreCase("MP3") 
                    || fileExtension.equalsIgnoreCase("M3U"))
                  {
                      flashLed(LED_GREEN);
                      lastTrack = track;
                      player.connecttoSD(track, false);
                  }
                  else 
                  {
                      flashLed(LED_BLUE);
                      ESP_LOGW(TAG, "Unsupported File Extension");
                  }
              } 
              else 
              {
                  flashLed(LED_BLUE);
                  ESP_LOGW(TAG, "Unsupported File Type");
              }
            }
            else
            {
              flashLed(LED_GREEN); // is playing?
            }
          }
          else
          {
            flashRing(CRGB::Yellow);
            displayTimer = millis()+250;
          }
        }
      }
    }
  }

  if (!player.isPlaying() 
  && millis() > lastStandbyCheck + standbyCheckIntervall)
  {
    lastStandbyCheck=millis();
    if (millis() > standbyTimer+gotoStandbyAfter)
    {
      standBy();
    }
    ESP_LOGV(TAG, "Standby in %lu", (standbyTimer+gotoStandbyAfter - millis()) /1000);
  }

}